[
    {
        "name": "Kate Evans, MA, AMFT",
        "position": "Counselor",
        "services": "EFT Couples therapy, DBT, Psychosynthesis training, Hakomi Essential skills.",
        "blurb": "I believe that relationships offer an opportunity for healing, and by exploring our hurts and needs together in therapy, we can strengthen the loving bond and trust between partners. Drawing from various theories and modalities, I provide a warm and validating approach to help couples break free from negative cycles and build a stronger connection, working with diverse clients across different cultures, identities, and life stages.",
        "picture": "/assets/team/picture_kate.jpg"
    },
    {
        "name": "Amber Martin, LMFT",
        "position": "Counselor",
        "services": "EFT, Co-parenting therapy, Women's Emotional Wellness",
        "blurb": "Trained in Emotionally Focused Therapy, I help couples navigate conflict and distress by fostering connection, understanding, and security in their relationship. I also work with co-parenting couples to improve communication and create a peaceful environment centered around their children. For individuals, particularly women seeking emotional wellness, I provide a safe space to overcome self-doubt, validate their thoughts, and embrace authenticity. Together, we can cultivate effective communication, self-love, and let go of unhelpful patterns.",
        "picture": "/assets/team/picture_amber.png"
    },
    {
        "name": "Adam Harrison, LCSW",
        "position": "Counselor",
        "services": "EFT Couples therapy",
        "blurb": "In my practice, I utilize Emotionally Focused Therapy (EFT) to transform communication, create safety, and foster connection in relationships. EFT is a highly effective approach backed by over 30 years of research, with over 90% of couples experiencing significant improvement and 75% maintaining it for two years. By interrupting cycles of distress and disconnection, EFT helps couples be seen and deeply understood by their partners. Reach out today for an appointment and let's embark on this journey together.",
        "picture": "/assets/team/picture_adam.jpg"
    },
    {
        "name": "Jennifer Smith, AMFT",
        "position": "Counselor",
        "services": "EFT Couples therapy",
        "blurb": "Utilizing Emotionally Focused Therapy (EFT), I specialize in couples therapy, fostering safety, connection, and healing. With over 30 years of research supporting its effectiveness, EFT helps couples transform communication and interrupt distressing cycles. By addressing deep emotional needs and establishing trust, couples can find profound growth and lasting improvement in their relationships. Reach out today for an appointment and begin your journey towards a stronger and more fulfilling connection.",
        "picture": "/assets/team/picture_jennifer.jpg"
    },
    {
        "name": "Sara Richardson, AMFT",
        "position": "Counselor",
        "services": "EFT couples therapy",
        "blurb": "As a therapist trained in Emotionally Focused Therapy (EFT), I help couples understand that conflict and distress in relationships are often a call for connection. By slowing down and exploring their internal processes, couples can break unhealthy cycles and strengthen their bond. I work alongside individuals and couples to foster a greater sense of belonging, connection, and satisfaction.",
        "picture": "/assets/team/picture_sara.jpg"
    },
    {
        "name": "Danielle Brandon, AMFT",
        "position": "Counselor",
        "services": "EFT couples therapy, Overall emotional health, and identity curiosity and exploration",
        "blurb": "With support, we can all grow, recognize our strengths, and live a more meaningful, connected, and enjoyable life. I approach therapy with curiosity, exploring the unique experiences, backgrounds, identities, and contexts that shape us. I understand that relationships can be both sources of wounds and profound healing. I help couples learn healthy communication, break patterns, and create a safe, caring connection.",
        "picture": "/assets/team/picture_danielle.jpg"
    },
    {
        "name": "Meryl Haggege, AMFT",
        "position": "Counselor",
        "services": "EFT, Psychodynamic therapy, Trauma-informed and culturally responsive framework, Nonviolent Communication",
        "blurb": "In my work as a therapist, I prioritize caring for others and helping them build stronger relationships. Holding a space of love and respect, I witness clients as they integrate trauma, including attachment trauma. Trusting their inner healer, I provide a non-judgmental environment for their experiences.",
        "picture": "/assets/team/picture_meryl.jpg"
    },
    {
        "name": "Grady Fort, LMFT",
        "position": "Clinical Director",
        "services": "EFT Couples therapy, Psychosynthesis training, Hakomi Essential skills.",
        "blurb": "I help couples to realize that the conflicts that they are having with their partners are in fact a protest for greater connection with each other. I am a Certified Emotionally Focused Couples Therapist (EFT) and Supervisor Candidate. I provide both individual and couples therapy as well as supervision to clinicians in the practice of using EFT to transform their work with couples and individuals.",
        "picture": "/assets/team/picture_grady.jpg"
    },
    {
        "name": "William \"Bill\" Ward, LMFT",
        "position": "Counselor",
        "services": "Queer friendly, addiction, couples counseling and Individual support",
        "blurb": "I am an experienced couples therapist specializing in transforming communication patterns and addressing underlying issues to improve relationships. I provide a safe and inclusive space for diverse couples, offering individual therapy for personal growth and issues like addiction and life transitions. Clients value my warmth, attentiveness, and guidance in their journey towards a healthier and happier life.",
        "picture": "/assets/team/picture_bill.jpg"
    }
]